/* Title shown below the auto icon in the context menu */
"AutoMenuItemTitle" = "Auto";

/* Title shown below the away icon in the context menu */
"AwayMenuItemTitle" = "Away";

/* describes the current temperature from a thermostat */
"CurrentTemperatureDescription" = "now %d°";

/* Title shown below the home icon in the context menu */
"HomeMenuItemTitle" = "Home";

/* informs the user data is being loaded */
"LoadingDataInformation" = "Loading data..";

/* describes that a location is not occupied */
"LocationNotOccupiedDescription" = "away";

/* Title shown below the manual icon in the context menu */
"ManualMenuItemTitle" = "Manual";

/* informs the user that a sign in with the counterpart iOS app is required */
"SignInRequiredInformation" = "Sign in with the cosy app on your iPhone";

/* describes the temperature set-point of a thermostat */
"TemperatureSetpointDescription" = "%d°";

/* describes that a thermostat is in auto mode */
"ThermostatInAutoModeDescription" = "auto";

/* Informs the user that the thermostat is in cooling state */
"CoolingStateDescription" = "cool";

/* The default name of a location */
"DefaultLocationName" = "location";

/* Informs the user that the thermostat is in heating state */
"HeatingStateDescription" = "heat";

/* Informs the user that the thermostat is in idle state */
"IdleStateDescription" = "idle";

/* Message shown to the user when an error occurs while fetching information of a thermostat */
"ErrorFetchingThermostatInformation" = "Could not fetch new data of thermostat %@";

/* Message shown to the user when an error occurs while fetching the list of thermostats */
"ErrorFetchingListOfThermostats" = "Could not fetch list of thermostats";

/* Title shown on the modal view shown to the user when clicking on an error indicator */
"ErrorInterfaceControllerModalTitle" = "Close";

/* Error: Failed to construct header for authorized access */
"FetchPresentValueHeaderFailure" = "Could not construct the header required for authorzied access";

/* Error: Failed to construct URL for fetching present value */
"FetchPresentValueURLFailure" = "Could not construct the url for fetching the present value of point %@";

/* Error retrieving present value */
"FetchPresentValueFailure" = "Error retrieving present value of point %@. Detailed error = %@";

/* Error constructing url for changing the temperature set point */
"SetPresentValueURLFailure" = "Could not construct the url for changing the temperature set point";

/* Error changing the temperature set point */
"SetPresentValueFailure" = "Error changing temperature set point of thermostat %@. Detailed error = %@";

/* Accessibility Hint: Thermostat in list */
"ThermostatRowHint" = "Double tap to view more or change the temperature set point";

/* Accessibility Label: Thermostat in list */
"ThermostatRowLabel" = "%@ set to %d°, %@";

/* Thermostat state: Occupied */
"ThermostatStateOccupied" = "occupied";

/* Thermostat state: Not occupied */
"ThermostatStateNotOccupied" = "not occupied";